goals-app-api/app/controllers/goals_controller.rb

INSERT INTO "goals" ("goalname", "deadline", "importance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
		def create
			goal = Goal.new(goal_params)
			goal.user = current_user
			if goal.save

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1]]
---
		def destroy
			goal = Goal.find_by_id(params[:id])
			if goal.destroy